/*E7 Практик 2
Инверсия половинок
Считать массив из 10 элементов и выполнить инверсию отдельно для 1-ой и 2-ой половин массива. Необходимо изменить считанный массив и напечатать его одним циклом.

Данные на входе: 		10 целых элементов массива через пробел.
Данные на выходе: 	10 целых элементов массива через пробел.

Пример №1
Данные на входе: 		4 -5 3 10 -4 -6 8 -10 1 0
Данные на выходе: 	-4 10 3 -5 4 0 1 -10 8 -6

Пример №2
Данные на входе: 		1 2 3 4 5 6 7 8 9 10
Данные на выходе: 	5 4 3 2 1 10 9 8 7 6*/
#include <stdio.h>
#define N 10

void SwappArr(int arr[], int i, int j) // функция перестановки членов массива
{
    int temp = arr[i];
    arr[i] = arr[j];
    arr[j] = temp;
}

int Input (int arr[], int n) //описание функции ввода
{
    int i;
    puts("Put in elements of array: ");
    for (i = 0; i < n; i++) //ввод массива
        scanf ("%d", &arr[i]);
    return i;
}

void print(int arr[], int n) // функция выводит массив в консоль
{
    for(int i = 0; i < n; i++)
    {
        printf("%d ", arr[i]);
    }
}

int main(void)
{
    int arr[N];
    Input(arr, N); // ввод элементов массива
    for(int j = 0; j < N/4; j++)
    {
       SwappArr(arr, j, N/2 - 1 - j);
    }
    for(int k = 0; k <= N/4; k++)
    {
       SwappArr(arr, N/2+k, N - 1 - k);
    }
    puts("\n");
    print(arr, N); // Вывод массива
    return 0;
}
