
/*D3 Практик 1
В обратном порядке
Дано целое неотрицательное число N. Выведите все его цифры по одной, в обратном порядке, разделяя их пробелами или новыми строками.
Данные на входе: 		Одно неотрицательное целое число
Данные на выходе: 	Последовательность цифр введенного числа в обратном порядке через пробел

Пример №1
Данные на входе: 		15
Данные на выходе: 	5 1

Пример №2
Данные на входе: 		54321
Данные на выходе: 	1 2 3 4 5 */

#include <stdio.h>

int dgt_revers(int n)
{
  if (n < 10)
  {
    printf("%d", n);
    return n;
  }
  printf("%d ", n%10);
  return dgt_revers(n / 10);
}

int main()
{
    int a = 0;
    scanf("%d", &a);
    dgt_revers(a);
    return 0;
}













